zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_pwr.c
/**
  ******************************************************************************
  * @file    stm32mp13xx_hal_pwr.c
  * @author  MCD Application Team
  * @brief   PWR HAL module driver.
  *          This file provides firmware functions to manage the following
  *          functionalities of the Power Controller (PWR) peripheral:
  *           + Initialization and de-initialization functions
  *           + Peripheral Control functions
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32mp13xx_hal.h"



/** @addtogroup STM32MP13xx_HAL_Driver
  * @{
  */

/** @defgroup PWR PWR
  * @brief PWR HAL module driver
  * @{
  */

#ifdef HAL_PWR_MODULE_ENABLED

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/** @addtogroup PWR_Private_Constants PWR Private Constants
  * @{
  */

/** @defgroup PWR_PVD_Mode_Mask PWR PVD Mode Mask
  * @{
  */
#define PVD_MODE_IT              ((uint32_t)0x00010000U)
#define PVD_RISING_EDGE          ((uint32_t)0x00000001U)
#define PVD_FALLING_EDGE         ((uint32_t)0x00000002U)
#define PVD_RISING_FALLING_EDGE  ((uint32_t)0x00000003U)
/**
  * @}
  */

/**
  * @}
  */

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/** @defgroup PWR_Private_Functions PWR Private Functions
  * @{
  */

/** @defgroup PWR_Group1 Initialization and de-initialization functions
  *  @brief    Initialization and de-initialization functions
  *
@verbatim
 ===============================================================================
              ##### Initialization and de-initialization functions #####
 ===============================================================================
    [..]
      After reset, the backup domain (RTC registers, RTC backup data
      registers and backup SRAM) is protected against possible unwanted
      write accesses.
      To enable access to the RTC Domain and RTC registers, proceed as follows:
        (+) Enable access to RTC domain using the HAL_PWR_EnableBkUpAccess()
            function.

@endverbatim
  * @{
  */


/**
  * @brief  Enables access to the backup domain
  *         In reset state, the RCC_BDCR, PWR_CR2, RTC, and backup registers are
  *         protected against parasitic write access. DBP bit must be set to
  *         enable write access to these.
  * @note   If the HSE divided by 2, 3, ..31 is used as the RTC clock, the
  *         Backup Domain Access should be kept enabled.
  * @retval None
  */
void HAL_PWR_EnableBkUpAccess(void)
{
  /* Enable access to RTC and backup registers */
  SET_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @brief Disables access to the backup domain (RTC registers, RTC
  *         backup data registers and backup SRAM).
  * @note If the HSE divided by 2, 3, ..31 is used as the RTC clock, the
  *         Backup Domain Access should be kept enabled.
  * @retval None
  */
void HAL_PWR_DisableBkUpAccess(void)
{
  /* Disable access to RTC and backup registers */
  CLEAR_BIT(PWR->CR1, PWR_CR1_DBP);
}

/**
  * @}
  */

/** @defgroup PWR_Group2 Peripheral Control functions
  *  @brief Low Power modes configuration functions
  *
@verbatim

 ===============================================================================
                 ##### Peripheral Control functions #####
 ===============================================================================

    *** PVD configuration ***
    =========================
    [..]
      (+) The PVD is used to monitor the VDD power supply by comparing it to a
          threshold selected by the PVD Level (PLS[2:0] bits in the PWR_CR1).
      (+) The PVD can also be used to monitor a voltage level on the PVD_IN pin.
          In this case, the voltage level on PVD_IN is compared to the internal
          VREFINT level.
      (+) A PVDO flag is available, in the PWR control status register 1
          (PWR_CSR1), to indicate whether VDD or voltage level on PVD_IN is
          higher or lower than the PVD threshold. This event is internally
          connected to the EXTI line16 and can generate an interrupt if enabled.
          This is done through __HAL_PWR_PVD_AVD_EXTI_ENABLE_IT() macro.
      (+) The PVD is stopped in Standby mode.

    *** WakeUp pins configuration ***
    ================================
    [..]
      (+) WakeUp pins are used to wake up the system from Standby mode. WKUP
          pins, if enabled, the WKUP pin pulls can be configured by WKUPPUPD
          register bits in PWR wakeup control register (PWR_WKUPCR).

    *** Low Power modes configuration ***
    =====================================
    [..]
      Several Low-power modes are available to save power when the MPU and/or
      MCU do not need to execute code (i.e. when waiting for an external event).
      Please refer to Reference Manual for more information.
      MPU and MCU sub-system modes:
      (+) CSleep mode: MPU/MCU clocks stopped and the MPU/MCU sub-system allocated
                       peripheral(s) clocks operate according to RCC PERxLPEN
      (+) CStop mode: MPU/MCU and MPU/MCU sub-system peripheral(s) clock stopped
      (+) CStandby mode: MPU and MPU sub-system peripheral(s) clock stopped and
                         wakeup via reset
      System modes:
      (+) Stop mode: bus matrix clocks stalled, the oscillators can be stopped.
                     VDDCORE is supplied.
                     To enter into this mode:
                     - Both MPU and MCU sub-systems are in CStop or CStandby.
                     - At least one PDDS bit (PWR_MPUCR/PWR_MCUCR) selects Stop.
      (+) LP-Stop mode: bus matrix clocks stalled, the oscillators can be stopped.
                        VDDCORE is supplied.
                        To enter into this mode:
                        - Both MPU and MCU sub-systems are in CStop or CStandby.
                        - The LPDS bit (PWR_CR1) selects LP-Stop.
                        - The LVDS bit (PWR_CR1) selects normal voltage.
                        - At least one PDDS bit (PWR_MPUCR/PWR_MCUCR) selects Stop.
      (+) LPLV-Stop mode: bus matrix clocks stalled, the oscillators can be stopped.
                          VDDCORE may be supplied at a lower level.
                          To enter into this mode:
                          - Both MPU and MCU sub-systems are in CStop or CStandby.
                          - The LPDS and LVDS bits (PWR_CR1) select LPLV-Stop.
                          - At least one PDDS bit (PWR_MPUCR/PWR_MCUCR) selects Stop.
      (+) Standby mode: System powered down.
                        To enter into this mode:
                        - MPU sub-system is in CStandby or CStop with CSTBYDIS = 1
                          and MCU subsystem is in CStop.
                        - All PDDS bits (PWR_MPUCR/PWR_MCUCR) select Standby.

   *** CSleep mode ***
   ==================
    [..]
      (+) Entry:
        The CSleep mode is entered by using the HAL_PWR_EnterSLEEPMode(Regulator, SLEEPEntry)
        functions with:
        (++) STOPEntry:
          (++) PWR_SLEEPENTRY_WFI: enter SLEEP mode with WFI instruction
          (++) PWR_SLEEPENTRY_WFE: enter SLEEP mode with WFE instruction

      -@@- The Regulator parameter is not used for the STM32MP1 family
           and is kept as parameter just to maintain compatibility with the
           lower power families (STM32L). Use i.e. PWR_MAINREGULATOR_ON
      (+) Exit:
          MCU: Any peripheral interrupt acknowledged by the nested vectored interrupt
          controller (NVIC) if entered by WFI or any event if entered by WFE
          MPU: Any Interrupt enabled in GIC if entered by WFI or any event if
          entered by WFE


