zephyrproject-rtos/hal_stm32/stm32cube/stm32mp13xx/drivers/src/stm32mp13xx_hal_pwr.c
    case PWR_WAKEUP_PIN3:
      __HAL_WKUP_EXTI_ENABLE_IT(EXTI_IMR2_IM57);
      break;

    case PWR_WAKEUP_PIN4:
      __HAL_WKUP_EXTI_ENABLE_IT(EXTI_IMR2_IM58);
      break;

    case PWR_WAKEUP_PIN5:
      __HAL_WKUP_EXTI_ENABLE_IT(EXTI_IMR2_IM59);
      break;

    case PWR_WAKEUP_PIN6:
      __HAL_WKUP_EXTI_ENABLE_IT(EXTI_IMR2_IM60);
      break;

    default:
      break;
  }
}


/**
  * @brief Disable WakeUp PINx Interrupt on AIEC and NVIC.
  * @param WakeUpPinx: Specifies the Power Wake-Up pin
  *         This parameter can be one of the following values:
  *           @arg PWR_WAKEUP_PIN1
  *           @arg PWR_WAKEUP_PIN2
  *           @arg PWR_WAKEUP_PIN3
  *           @arg PWR_WAKEUP_PIN4
  *           @arg PWR_WAKEUP_PIN5
  *           @arg PWR_WAKEUP_PIN6
  * @retval None
  */
void HAL_PWR_DisableWakeUpPinIT(uint32_t WakeUpPinx)
{
  assert_param(IS_PWR_WAKEUP_PIN(WakeUpPinx));
  switch ((WakeUpPinx & PWR_WAKEUP_PIN_MASK))
  {
    case PWR_WAKEUP_PIN1:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM55);
      break;

    case PWR_WAKEUP_PIN2:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM56);
      break;

    case PWR_WAKEUP_PIN3:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM57);
      break;

    case PWR_WAKEUP_PIN4:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM58);
      break;

    case PWR_WAKEUP_PIN5:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM59);
      break;

    case PWR_WAKEUP_PIN6:
      __HAL_WKUP_EXTI_DISABLE_IT(EXTI_IMR2_IM60);
      break;

    default:
      break;
  }
}

/**
  * @brief Enters CSleep mode.
  *
  * @note In CSleep mode, all I/O pins keep the same state as in Run mode.
  *
  * @note In CSleep mode, the systick is stopped to avoid exit from this mode with
  *       systick interrupt when used as time base for Timeout
  *
  * @param Regulator: Specifies the regulator state in CSLEEP mode.
  *          This parameter is not used for the STM32MP1 family and is kept as
  *          parameter just to maintain compatibility with the lower power families
  *            This parameter can be one of the following values:
  *            @arg PWR_MAINREGULATOR_ON: CSLEEP mode with regulator ON
  *            @arg PWR_LOWPOWERREGULATOR_ON: CSLEEP mode with low power regulator ON
  * @param SLEEPEntry: Specifies if CSLEEP mode in entered with WFI or WFE instruction.
  *          This parameter can be one of the following values:
  *            @arg PWR_SLEEPENTRY_WFI: enter CSLEEP mode with WFI instruction
  *            @arg PWR_SLEEPENTRY_WFE: enter CSLEEP mode with WFE instruction
  * @retval None
  */
void HAL_PWR_EnterSLEEPMode(uint32_t Regulator, uint8_t SLEEPEntry)
{
  /* Check the parameters */
  assert_param(IS_PWR_REGULATOR(Regulator));
  assert_param(IS_PWR_SLEEP_ENTRY(SLEEPEntry));


  /* Select SLEEP mode entry -------------------------------------------------*/
  if (SLEEPEntry == PWR_SLEEPENTRY_WFI)
  {
    /* Request Wait For Interrupt */
    __WFI();
  }
  else
  {
    /* Request Wait For Event */
    __SEV();
    __WFE();
    __WFE();
  }
}


/**
  * @brief Enters CSTOP
  *        This function puts core domain into CSTOP allowing system STOP mode
  *        if both MPU and MCU cores are on CSTOP mode
  * @note In Stop mode, all I/O pins keep the same state as in Run mode.
  * @note When exiting Stop mode by issuing an interrupt or a wake up event,
  *       the HSI oscillator is selected as Core system clock.
  * @note RCC_WAKEUP_IRQn IT must be programmed to have the highest priority and
  *       to be the only one IT having this value before calling HAL_PWR_EnterSTOPMode.
  *       Make sure RCC_WAKEUP_IRQn is the only one IT allowed to wake up core
  *       before calling  HAL_PWR_EnterSTOPMode (BASEPRI)
  *       Reestablish priority level once system is completely waken up (clock
  *       restore and IO compensation)
  * @note When the voltage regulator operates in low power mode, an additional
  *         startup delay is incurred when waking up from Stop mode.
  *         By keeping the internal regulator ON during Stop mode, the consumption
  *         is higher although the startup time is reduced.
  * @param Regulator: Specifies the regulator state in Stop mode.
  *          This parameter is unused on MCU but any value must be provided.
  *          This parameter can be one of the following values:
  *            @arg PWR_MAINREGULATOR_ON: Stop mode with regulator ON
  *            @arg PWR_LOWPOWERREGULATOR_ON: Stop mode with low power regulator ON
  * @param STOPEntry: Specifies if CStop mode is entered with WFI or WFE instruction.
  *          This parameter can be one of the following values:
  *            @arg PWR_STOPENTRY_WFI: Enter CStop mode with WFI instruction
  *            @arg PWR_STOPENTRY_WFE: Enter CStop mode with WFE instruction
  * @retval None
  */
void HAL_PWR_EnterSTOPMode(uint32_t Regulator, uint8_t STOPEntry)
{
  /* Check the parameters */
  assert_param(IS_PWR_REGULATOR(Regulator));
  assert_param(IS_PWR_STOP_ENTRY(STOPEntry));


#ifdef CORE_CA7
  if (Regulator == PWR_MAINREGULATOR_ON)
  {
    /* Select STOP mode */
    CLEAR_BIT(PWR->CR1, PWR_CR1_LPDS);
  }
  else
  {
    /* Select LP-STOP mode */
    SET_BIT(PWR->CR1, PWR_CR1_LPDS);
  }

  /* Clear MPU STANDBY, STOP and HOLD flags.(Always read as 0) */
  SET_BIT(PWR->MPUCR, PWR_MPUCR_CSSF);

  /* MPU STAY in STOP MODE */
  CLEAR_BIT(PWR->MPUCR, PWR_MPUCR_PDDS);

  CLEAR_BIT(PWR->CR1, PWR_CR1_STOP2);

  /* RCC Stop Request Set Register */
#if defined(RCC_MP_SREQSETR_STPREQ_P0) & defined(RCC_MP_SREQSETR_STPREQ_P1)
  /* CA7_CORE0 and CA7_CORE1 available */
  RCC->MP_SREQSETR = RCC_MP_SREQSETR_STPREQ_P0 | RCC_MP_SREQSETR_STPREQ_P1;
#else
  /* Only CA7_CORE0 available */
  RCC->MP_SREQSETR = RCC_MP_SREQSETR_STPREQ_P0;
#endif /* RCC_MP_SREQSETR_STPREQ_P0 & RCC_MP_SREQSETR_STPREQ_P1 */

#else
  /* Prevent unused argument compilation warning */
  UNUSED(Regulator);
#endif /*CORE_CA7*/

  /* Select Stop mode entry --------------------------------------------------*/
  if ((STOPEntry == PWR_STOPENTRY_WFI))
  {
    /* Request Wait For Interrupt */
    __WFI();
  }
  else if (STOPEntry == PWR_STOPENTRY_WFE)
  {
    /* Request Wait For Event */
    __SEV();
    __WFE();
    __WFE();
  }
  else
  {
    /* Nothing to do */
  }


#ifdef CORE_CA7
  /* RCC Clear Request Set Register */
#if defined(RCC_MP_SREQCLRR_STPREQ_P0) & defined(RCC_MP_SREQCLRR_STPREQ_P1)
  /* CA7_CORE0 and CA7_CORE1 available */
  RCC->MP_SREQCLRR = RCC_MP_SREQCLRR_STPREQ_P0 | RCC_MP_SREQCLRR_STPREQ_P1;
#else
  /* Only CA7_CORE0 available */
  RCC->MP_SREQCLRR = RCC_MP_SREQCLRR_STPREQ_P0;
#endif /* RCC_MP_SREQCLRR_STPREQ_P0 | RCC_MP_SREQCLRR_STPREQ_P1 */
#endif /* CORE_CA7 */
}

/**
  * @brief Enters LPLV-Stop2 Mode
  * @note In LPLV-Stop2 mode VDD CPU power supply can be shut down
  *       CPU exit mode with a reset
  * @retval None
  */
void HAL_PWR_EnterLPLVStop2Mode(uint32_t Regulator)
{
  /* Check the parameters */
  assert_param(IS_PWR_REGULATOR(Regulator));

  /* Clear MPU STANDBY, STOP and HOLD flags.(Always read as 0) */
  SET_BIT(PWR->MPUCR, PWR_MPUCR_CSSF);

  /* PWR_ON pin changes when enter in STOP2 */
  /*SET_BIT(PWR->CR1, PWR_CR1_LPCFG);  FIXME, to verify this is useful ??? */

  /* PWR_LP pin changes when enter in STOP2 */
  if (Regulator == PWR_MAINREGULATOR_ON)
  {
    /* Select STOP mode */
    CLEAR_BIT(PWR->CR1, PWR_CR1_LPDS);
  }
  else
  {
    /* Select LP-STOP mode */
    SET_BIT(PWR->CR1, PWR_CR1_LPDS);
  }

  /* MPU goes to LPLV-Stop2 mode */
  SET_BIT(PWR->CR1, PWR_CR1_STOP2);

